zhengwang721/ASF/thirdparty/wireless/avr2025_mac/apps/mac/no_beacon/coord/main.c
/**
 * @file main.c
 *
 * @brief MAC Example Nobeacon Application - Coordinator
 *
 * Copyright (c) 2013 Atmel Corporation. All rights reserved.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3. The name of Atmel may not be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * 4. This software may only be redistributed and used in connection with an
 *    Atmel microcontroller product.
 *
 * THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * EXPRESSLY AND SPECIFICALLY DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 * \asf_license_stop
 */

/**
* \mainpage
* \section preface Preface
* This is the reference manual for the IEEE 802.15.4 MAC No-Beacon Application - Coordinator
* \section toc Table of Contents
*  - \subpage overview
*  -  \b Application \b Interface(API)
*    - \ref group_mac
*    - \ref group_pal
*    - \ref group_tal
*    - \ref group_resources
*  - \subpage main_files
*  - \subpage devsup
*  - \subpage compinfo
*  - \subpage references
*  - \subpage contactinfo
*/

/**
 * \page overview Overview
 * \section intro Introduction
 * The basic MAC Example Nobeacon Application deploys a nonbeacon-enabled network.
 * The coordinator starts a PAN at channel DEFAULT_CHANNEL with the PAN ID DEFAULT_PAN_ID.
 * The device scans for this network and associates to the coordinator.
 * Once the device is associated, it uses a timer that fires every 5 seconds to poll for pending data at the coordinator by means of transmitting a data request frame to the coordinator.
 * On the other hand every 5 seconds the coordinator queues a dummy data frame for each associated device into its indirect frame queue.
 * If the coordinator receives a data request frame from a particular device, it transmits the pending data frame to the device.
 * Device after receiving the data from the Coordinator sends back the same data to the Coordinator itself by direct data transmission
 * The results of the proper data transmission/reception are printed to a terminal program via Serial I/O (UART or USB).
 *
 * For demonstration purposes the coordinator's configuration is limited to associate two devices at maximum.
 */


/** \page main_files Application Files
 * - main.c\n                      Application main file.

 * \page devsup Device Support
 * - \b ATXMEGA256A3BU
 *                     - <A href="http://www.atmel.com/tools/xmega-a3buxplained.aspx"> \b   XMEGA-A3BU Xplained  </A>  <A href="http://store.atmel.com/PartDetail.aspx?q=p:10500293">\a Buy </A>\n
 * - \b ATXMEGA256A3U-Zigbit (USB )
 * - \b Atmega256rfr2 Xplained Pro
 * - \b UC3A3256S
*                      - <A href="http://www.atmel.com/tools/rz600.aspx"> \b RZ600 </A> <A href="http://store.atmel.com/PartDetail.aspx?q=p:10500245;c:100118">\a Buy </A>\n
 * \page compinfo Compilation Info
 * This software was written for the GNU GCC and IAR for AVR.
 * Other compilers may or may not work.
 *
 * \page references References
 * 1)  IEEE Std 802.15.4-2006 Part 15.4: Wireless Medium Access Control (MAC)
 *     and Physical Layer (PHY) Specifications for Low-Rate Wireless Personal Area
 *     Networks (WPANs).\n\n
 * 2)  AVR Wireless Support <A href="http://avr@atmel.com">avr@atmel.com</A>.\n
 * \page contactinfo Contact Information
 * For further information,visit
 * <A href="http://www.atmel.com/avr">www.atmel.com</A>.\n
 */

 /* === INCLUDES ============================================================ */
#include <string.h>
#include <inttypes.h>
#include <stdio.h>
#include "conf_board.h"
#include "avr2025_mac.h"
#include "led.h"
#include "delay.h"
#include "common_sw_timer.h"
#include "sio2host.h"
#include <asf.h>

/* === TYPES =============================================================== */

/** This type definition of a structure stores the short address and the
 *  extended address of a device.
 */
typedef struct associated_device_tag
{
    uint16_t short_addr;
    uint64_t ieee_addr;
} associated_device_t;

/* === MACROS ============================================================== */

#define DEFAULT_PAN_ID                  CCPU_ENDIAN_TO_LE16(0xBABE)

/** Defines the short address of the coordinator. */
#define COORD_SHORT_ADDR                (0x0000)
/** Defines the maximum number of devices the coordinator will handle. */
#define MAX_NUMBER_OF_DEVICES           (6)

#define CHANNEL_OFFSET                  (0)

#define SCAN_CHANNEL                    (1ul << current_channel)

/** Defines the scan duration time. */
#define SCAN_DURATION_COORDINATOR       (5)
/** Defines Beacon Order for Nobeacon Network. */
#define NOBEACON_BO                     (15)
/** Defines Superframe Order for Nobeacon Network. */
#define NOBEACON_SO                     (15)
/** Defines the time to initiate a indirect data transmission to the device. */
#define APP_INDIRECT_DATA_DURATION_MS   (5000)
/** Define the LED on duration time. */
#define LED_ON_DURATION                 (500000)

#define DEBOUNCE_DELAY_MS               (200)

#if (LED_COUNT >= 3)
#define LED_START                       (LED0)
#define LED_NWK_SETUP                   (LED1)
#define LED_DATA                        (LED2)
#elif (LED_COUNT == 2)
#define LED_START                       (LED0)
#define LED_NWK_SETUP                   (LED0)
#define LED_DATA                        (LED1)
#else
#define LED_START                       (LED0)
#define LED_NWK_SETUP                   (LED0)
#define LED_DATA                        (LED0)
#endif

/* === GLOBALS ============================================================= */

/** This array stores all device related information. */
static associated_device_t device_list[MAX_NUMBER_OF_DEVICES];

/** Stores the number of associated devices. */
static uint8_t no_of_assoc_devices;

/** Store the current MSDU handle to be used for a data frame. */
static uint8_t curr_msdu_handle;

/** Stores total receive count */
static uint32_t rx_cnt;

#ifdef GPIO_PUSH_BUTTON_0
static wpan_addr_spec_t dst_addr;
#endif //GPIO_PUSH_BUTTON_0

