zhengwang721/ASF/thirdparty/wireless/avr2025_mac/apps/mac/no_beacon/coord/main.c
static uint8_t current_channel;
static uint8_t current_channel_page;
static uint32_t channels_supported;

static uint8_t TIMER_LED_OFF;
static uint8_t APP_TIMER_INDIRECT_DATA;

/* === PROTOTYPES ========================================================== */
/**
 * @brief Application specific function to assign a short address
 *
 */
static bool assign_new_short_addr(uint64_t addr64, uint16_t *addr16);

/**
 * @brief Callback function for initiation of indirect data transmission
 *
 * @param parameter Pointer to callback parameter
 *                  (not used in this application, but could be used
 *                  to indicated LED to be switched off)
 */
static void indirect_data_cb(void *parameter);
/**
 * @brief Callback function switching off the LED
 *
 * @param parameter Pointer to callback parameter
 *                  (not used in this application, but could be used
 *                  to indicated LED to be switched off)
 */
static void led_off_cb(void *parameter);

/** Alert to indicate something has gone wrong in the application */
static void app_alert(void);

/* === IMPLEMENTATION ====================================================== */

/**
 * @brief Main function of the coordinator application
 *
 * This function initializes the MAC, initiates a MLME reset request
 * (@ref wpan_mlme_reset_req()), and implements a the main loop.
 */
int main(void)
{
	/* Initialize the board.
	 * The board-specific conf_board.h file contains the configuration of
	 * the board initialization.
	 */
	irq_initialize_vectors();
	board_init();
	sysclk_init();

	sw_timer_init();

	if(MAC_SUCCESS != wpan_init())
	{
		app_alert();
	}

    /* Initialize LEDs. */
    LED_On(LED_START);         // indicating application is started
    LED_Off(LED_NWK_SETUP);    // indicating network is started
    LED_Off(LED_DATA);         // indicating data reception

	cpu_irq_enable();

#ifdef SIO_HUB
    /* Initialize the serial interface used for communication with terminal program. */
    sio2host_init();
    /* To make sure the Hyper Terminal Connected to the system*/
    sio2host_getchar();

    printf("\nNobeacon_Application\r\n\n");
    printf("\nCoordinator\r\n\n");
#endif /* SIO_HUB */

	sw_timer_get_id(&TIMER_LED_OFF);
	sw_timer_get_id(&APP_TIMER_INDIRECT_DATA);


    /*
     * Reset the MAC layer to the default values.
     * This request will cause a mlme reset confirm message ->
     * usr_mlme_reset_conf
     */
    wpan_mlme_reset_req(true);

#ifdef GPIO_PUSH_BUTTON_0
	dst_addr.AddrMode = 2;
	dst_addr.PANId = DEFAULT_PAN_ID;
#endif //GPIO_PUSH_BUTTON_0

	while (true)
	{
		wpan_task();
#ifdef GPIO_PUSH_BUTTON_0
		if (!ioport_get_pin_level(GPIO_PUSH_BUTTON_0))
		{
			delay_ms(DEBOUNCE_DELAY_MS);
			if (!ioport_get_pin_level(GPIO_PUSH_BUTTON_0))
			{
				dst_addr.Addr.short_address = BROADCAST;
				wpan_mcps_data_req(FCF_SHORT_ADDR, &dst_addr, 14, 
								   (uint8_t *)"Broadcast Data", 1, WPAN_TXOPT_OFF);
			}
		}
#endif //GPIO_PUSH_BUTTON_0
	}
}


#if defined(ENABLE_TSTAMP)

/*
 * Callback function usr_mcps_data_conf
 *
 * @param msduHandle  Handle of MSDU handed over to MAC earlier
 * @param status      Result for requested data transmission request
 * @param Timestamp   The time, in symbols, at which the data were transmitted
 *                    (only if timestamping is enabled).
 *
 */
void usr_mcps_data_conf(uint8_t msduHandle,
                        uint8_t status,
                        uint32_t Timestamp)
#else
void usr_mcps_data_conf(uint8_t msduHandle,
                        uint8_t status)
#endif  /* ENABLE_TSTAMP */
{
#ifdef SIO_HUB
    char sio_array[255];

    sprintf(sio_array, "Result frame with handle %" PRIu8 ": ", msduHandle);
    printf(sio_array);
#endif

    if (status == MAC_SUCCESS)
    {
#ifdef SIO_HUB
        printf("Success\r\n");
#endif
    }
    else if (status == MAC_TRANSACTION_OVERFLOW)
    {
#ifdef SIO_HUB
        /* Frame could not be placed into the indirect queue. */
        printf("Transaction overflow\r\n");
#endif
    }
    else if (status == MAC_TRANSACTION_EXPIRED)
    {
#ifdef SIO_HUB
        /*
         * Frame could not be delivered to the target node within
         * the proper time.
         */
        printf("Transaction expired\r\n");
#endif
    }

    /* Keep compiler happy. */
    msduHandle = msduHandle;
#ifdef ENABLE_TSTAMP
    Timestamp = Timestamp;
#endif  /* ENABLE_TSTAMP */
}

/*
 * @brief Callback function usr_mcps_data_ind
 *
 * @param SrcAddrSpec      Pointer to source address specification
 * @param DstAddrSpec      Pointer to destination address specification
 * @param msduLength       Number of octets contained in MSDU
 * @param msdu             Pointer to MSDU
 * @param mpduLinkQuality  LQI measured during reception of the MPDU
 * @param DSN              DSN of the received data frame.
 * @param Timestamp        The time, in symbols, at which the data were received
 *                         (only if timestamping is enabled).
 */
void usr_mcps_data_ind(wpan_addr_spec_t *SrcAddrSpec,
                       wpan_addr_spec_t *DstAddrSpec,
                       uint8_t msduLength,
                       uint8_t *msdu,
                       uint8_t mpduLinkQuality,
#ifdef ENABLE_TSTAMP
                       uint8_t DSN,
                       uint32_t Timestamp)
#else
                       uint8_t DSN)
#endif  /* ENABLE_TSTAMP */
{
#ifdef SIO_HUB
    char sio_array[255];
#endif

    /* Increments the receive count*/
    rx_cnt++;

    /*
     * Dummy data has been received successfully.
     */
    LED_On(LED_DATA);

    /* Start a timer switching off the LED. */
    sw_timer_start(TIMER_LED_OFF,
                    LED_ON_DURATION,
                    SW_TIMEOUT_RELATIVE,
                    (FUNC_PTR)led_off_cb,
                    NULL);
#ifdef SIO_HUB
    sprintf(sio_array, "Frame received: %" PRIu32 ",data: %" PRIu8 "\r\n",
            rx_cnt, *msdu);
    printf(sio_array);
#endif
    /* Keep compiler happy. */
    SrcAddrSpec = SrcAddrSpec;
    DstAddrSpec = DstAddrSpec;
    msduLength = msduLength;
    msdu = msdu;
    mpduLinkQuality = mpduLinkQuality;
    DSN = DSN;
#ifdef ENABLE_TSTAMP
    Timestamp = Timestamp;
#endif  /* ENABLE_TSTAMP */
}


#if ((MAC_PURGE_REQUEST_CONFIRM == 1) && (MAC_INDIRECT_DATA_BASIC == 1))

