zhengwang721/ASF/thirdparty/wireless/avr2025_mac/apps/mac/no_beacon/coord/main.c
/*
 * Callback function usr_mlme_sync_loss_ind
 *
 * @param LossReason     Reason for synchronization loss.
 * @param PANId          The PAN identifier with which the device lost
 *                       synchronization or to which it was realigned.
 * @param LogicalChannel The logical channel on which the device lost
 *                       synchronization or to which it was realigned.
 * @param ChannelPage    The channel page on which the device lost
 *                       synchronization or to which it was realigned.
 *
 * @return void
 *
 */
void usr_mlme_sync_loss_ind(uint8_t LossReason,
                            uint16_t PANId,
                            uint8_t LogicalChannel,
                            uint8_t ChannelPage)
{
	
}


/*
 * @brief Application specific function to assign a short address
 *
 */
static bool assign_new_short_addr(uint64_t addr64, uint16_t *addr16)
{
    uint8_t i;
#ifdef SIO_HUB
    char sio_array[255];
#endif
    /* Check if device has been associated before. */
    for (i = 0; i < MAX_NUMBER_OF_DEVICES; i++)
    {
        if (device_list[i].short_addr == 0x0000)
        {
            /* If the short address is 0x0000, it has not been used before. */
            continue;
        }
        if (device_list[i].ieee_addr == addr64)
        {
            /* Assign the previously assigned short address again. */
            *addr16 = device_list[i].short_addr;
            return true;
        }
    }

    for (i = 0; i < MAX_NUMBER_OF_DEVICES; i++)
    {
        if (device_list[i].short_addr == 0x0000)
        {
            *addr16 = CPU_ENDIAN_TO_LE16(i + 0x0001);
            device_list[i].short_addr = CPU_ENDIAN_TO_LE16(i + 0x0001); /* Get next short address. */
            device_list[i].ieee_addr = addr64;      /* Store extended address. */
            no_of_assoc_devices++;
#ifdef SIO_HUB
            sprintf(sio_array, "Device %" PRIu8 " associated\r\n", i + 1);
            printf(sio_array);
#endif
            return true;
        }
    }

    /* If we are here, no short address could be assigned. */
    return false;
}
/* Alert to indicate something has gone wrong in the application */
static void app_alert(void)
{
    while (1)
    {
		#if LED_COUNT > 0
		LED_Toggle(LED0);
		#endif

		#if LED_COUNT > 1
		LED_Toggle(LED1);
		#endif

		#if LED_COUNT > 2
		LED_Toggle(LED2);
		#endif

		#if LED_COUNT > 3
		LED_Toggle(LED3);
		#endif

		#if LED_COUNT > 4
		LED_Toggle(LED4);
		#endif

		#if LED_COUNT > 5
		LED_Toggle(LED5);
		#endif

		#if LED_COUNT > 6
		LED_Toggle(LED6);
		#endif

		#if LED_COUNT > 7
		LED_Toggle(LED7);
		#endif
		delay_us(0xFFFF);
	}
}

/*
 * @brief Callback function for initiation of indirect data transmission
 *
 * @param parameter Pointer to callback parameter
 *                  (not used in this application, but could be used
 *                  to indicated LED to be switched off)
 */
static void indirect_data_cb(void *parameter)
{
    uint8_t cur_device;
    uint8_t src_addr_mode;
    wpan_addr_spec_t dst_addr;
    uint8_t payload;
#ifdef SIO_HUB
    char sio_array[255];
#endif

    /* Loop over all associated devices. */
    for (cur_device = 0; cur_device < no_of_assoc_devices; cur_device++)
    {
#ifdef SIO_HUB
        sprintf(sio_array, "Queue data for device %" PRIu8 " ", cur_device + 1);
        printf(sio_array);
#endif

        /*
         * Request transmission of indirect data to device.
         * This will just queue this frame into the indirect data queue.
         * Once this particular device polls for pending data,
         * the frame will be delivered to the device.
         */
        src_addr_mode = WPAN_ADDRMODE_SHORT;
        dst_addr.AddrMode = WPAN_ADDRMODE_SHORT;
        dst_addr.PANId = DEFAULT_PAN_ID;
        dst_addr.Addr.short_address = device_list[cur_device].short_addr;

        payload = (uint8_t)rand();  // Any dummy data
        curr_msdu_handle++;         // Increment handle
#ifdef SIO_HUB
        sprintf(sio_array, "(MSDU handle: %" PRIu8 ") data: %" PRIu8 "\r\n",
                curr_msdu_handle, payload);
        printf(sio_array);
#endif
        if (!wpan_mcps_data_req(src_addr_mode,
                                &dst_addr,
                                1,  // One octet
                                &payload,
                                curr_msdu_handle,
                                WPAN_TXOPT_INDIRECT_ACK)
           )
        {
            /*
             * Data could not be queued into the indirect queue.
             * Add error handling if required.
             */
        }
    }

    /* Start timer to initiate indirect data transmission. */
    sw_timer_start(APP_TIMER_INDIRECT_DATA,
                    ((uint32_t)APP_INDIRECT_DATA_DURATION_MS * 1000),
                    SW_TIMEOUT_RELATIVE,
                    (FUNC_PTR)indirect_data_cb,
                    NULL);

    parameter = parameter;  /* Keep compiler happy. */
}
/*
 * @brief Callback function switching off the LED
 *
 * @param parameter Pointer to callback parameter
 *                  (not used in this application, but could be used
 *                  to indicated LED to be switched off)
 */
static void led_off_cb(void *parameter)
{
    LED_Off(LED_DATA);

    parameter = parameter;  /* Keep compiler happy. */
}
